# Emisions Practice project

In [84]:
print("Tu mama")

Tu mama

In [85]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sb 

data = pd.read_csv("global_greenhouse_gas_emission_from_agriculture.csv") 
data

,Domain Code,Domain,Area Code (M49),Area,Element Code,Element,Item Code,Item,Year Code,Year,Source Code,Source,Unit,Value,Flag,Flag Description,Note
0,GT,Emissions totals,4,Afghanistan,7225,Emissions (CH4),6995,Emissions on agricultural land,1990,1990,3050,FAO TIER 1,kt,214.4467,E,Estimated value,NaN
1,GT,Emissions totals,4,Afghanistan,7225,Emissions (CH4),6995,Emissions on agricultural land,1991,1991,3050,FAO TIER 1,kt,224.1393,E,Estimated value,NaN
2,GT,Emissions totals,4,Afghanistan,7225,Emissions (CH4),6995,Emissions on agricultural land,1992,1992,3050,FAO TIER 1,kt,226.7224,E,Estimated value,NaN
3,GT,Emissions totals,4,Afghanistan,7225,Emissions (CH4),6995,Emissions on agricultural land,1993,1993,3050,FAO TIER 1,kt,228.5003,E,Estimated value,NaN
4,GT,Emissions totals,4,Afghanistan,7225,Emissions (CH4),6995,Emissions on agricultural land,1994,1994,3050,FAO TIER 1,kt,236.9822,E,Estimated value,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
22211,GT,Emissions totals,716,Zimbabwe,7230,Emissions (N2O),6995,Emissions on agricultural land,2017,2017,3050,FAO TIER 1,kt,15.4064,E,Estimated value,NaN
22212,GT,Emissions totals,716,Zimbabwe,7230,Emissions (N2O),6995,Emissions on agricultural land,2018,2018,3050,FAO TIER 1,kt,15.4385,E,Estimated value,NaN
22213,GT,Emissions totals,716,Zimbabwe,7230,Emissions (N2O),6995,Emissions on agricultural land,2019,2019,3050,FAO TIER 1,kt,15.0984,E,Estimated value,NaN
22214,GT,Emissions totals,716,Zimbabwe,7230,Emissions (N2O),6995,Emissions on agricultural land,2020,2020,3050,FAO TIER 1,kt,13.4151,E,Estimated value,NaN
22215,GT,Emissions totals,716,Zimbabwe,7230,Emissions (N2O),6995,Emissions on agricultural land,2021,2021,3050,FAO TIER 1,kt,14.3762,E,Estimated value,NaN

In [86]:

data = data.drop(columns=["Flag", "Note", "Item", "Unit", "Domain"])
data

,Domain Code,Area Code (M49),Area,Element Code,Element,Item Code,Year Code,Year,Source Code,Source,Value,Flag Description
0,GT,4,Afghanistan,7225,Emissions (CH4),6995,1990,1990,3050,FAO TIER 1,214.4467,Estimated value
1,GT,4,Afghanistan,7225,Emissions (CH4),6995,1991,1991,3050,FAO TIER 1,224.1393,Estimated value
2,GT,4,Afghanistan,7225,Emissions (CH4),6995,1992,1992,3050,FAO TIER 1,226.7224,Estimated value
3,GT,4,Afghanistan,7225,Emissions (CH4),6995,1993,1993,3050,FAO TIER 1,228.5003,Estimated value
4,GT,4,Afghanistan,7225,Emissions (CH4),6995,1994,1994,3050,FAO TIER 1,236.9822,Estimated value
...,...,...,...,...,...,...,...,...,...,...,...,...
22211,GT,716,Zimbabwe,7230,Emissions (N2O),6995,2017,2017,3050,FAO TIER 1,15.4064,Estimated value
22212,GT,716,Zimbabwe,7230,Emissions (N2O),6995,2018,2018,3050,FAO TIER 1,15.4385,Estimated value
22213,GT,716,Zimbabwe,7230,Emissions (N2O),6995,2019,2019,3050,FAO TIER 1,15.0984,Estimated value
22214,GT,716,Zimbabwe,7230,Emissions (N2O),6995,2020,2020,3050,FAO TIER 1,13.4151,Estimated value
22215,GT,716,Zimbabwe,7230,Emissions (N2O),6995,2021,2021,3050,FAO TIER 1,14.3762,Estimated value

In [87]:
sanitized_names = data.columns.str.replace(" ", "_")

data.columns = sanitized_names

In [88]:
data = data.drop(columns=["Flag_Description", "Domain_Code", "Source_Code", "Area", "Source"])
data

,Area_Code_(M49),Element_Code,Element,Item_Code,Year_Code,Year,Value
0,4,7225,Emissions (CH4),6995,1990,1990,214.4467
1,4,7225,Emissions (CH4),6995,1991,1991,224.1393
2,4,7225,Emissions (CH4),6995,1992,1992,226.7224
3,4,7225,Emissions (CH4),6995,1993,1993,228.5003
4,4,7225,Emissions (CH4),6995,1994,1994,236.9822
...,...,...,...,...,...,...,...
22211,716,7230,Emissions (N2O),6995,2017,2017,15.4064
22212,716,7230,Emissions (N2O),6995,2018,2018,15.4385
22213,716,7230,Emissions (N2O),6995,2019,2019,15.0984
22214,716,7230,Emissions (N2O),6995,2020,2020,13.4151
22215,716,7230,Emissions (N2O),6995,2021,2021,14.3762

In [89]:
def map_eletemt_to_number (ele:str) -> int:
    match ele:
        case "Emissions (CH4)": return 1
        case "Emissions (CO2)": return 2
        case "Emissions (N2O)": return 3
    
    return -1

data["Element"] = data["Element"].apply(map_eletemt_to_number)

In [90]:
data

,Area_Code_(M49),Element_Code,Element,Item_Code,Year_Code,Year,Value
0,4,7225,1,6995,1990,1990,214.4467
1,4,7225,1,6995,1991,1991,224.1393
2,4,7225,1,6995,1992,1992,226.7224
3,4,7225,1,6995,1993,1993,228.5003
4,4,7225,1,6995,1994,1994,236.9822
...,...,...,...,...,...,...,...
22211,716,7230,3,6995,2017,2017,15.4064
22212,716,7230,3,6995,2018,2018,15.4385
22213,716,7230,3,6995,2019,2019,15.0984
22214,716,7230,3,6995,2020,2020,13.4151
22215,716,7230,3,6995,2021,2021,14.3762

In [91]:
data = data.drop(columns=["Element"])

In [92]:
data

       Area_Code_(M49)  Element_Code  Item_Code  Year_Code  Year     Value
0                    4          7225       6995       1990  1990  214.4467
1                    4          7225       6995       1991  1991  224.1393
2                    4          7225       6995       1992  1992  226.7224
3                    4          7225       6995       1993  1993  228.5003
4                    4          7225       6995       1994  1994  236.9822
...                ...           ...        ...        ...   ...       ...
22211              716          7230       6995       2017  2017   15.4064
22212              716          7230       6995       2018  2018   15.4385
22213              716          7230       6995       2019  2019   15.0984
22214              716          7230       6995       2020  2020   13.4151
22215              716          7230       6995       2021  2021   14.3762

[22216 rows x 6 columns]